Revit 2027 API
RenderingSettings.UsesRegionRendering Property
 The bool value that indicates whether to use region rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UsesRegionRendering { get; set; }
Public Property UsesRegionRendering As Boolean
	Get
	Set
public:
property bool UsesRegionRendering {
	bool get ();
	void set (bool value);
}
member UsesRegionRendering : bool with get, set
Property Value
Boolean
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace